MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
		 //Reset lock LED
		 HAL_GPIO_WritePin(LED_LOCK_GPIO_Port, LED_LOCK_Pin, GPIO_PIN_RESET);

		 //Unmask exti line 1, 2 and 3
		 EXTI->IMR1 |= EXTI_IMR1_IM8; //unmask exti line 8
		 EXTI->IMR1 |= EXTI_IMR1_IM4; //unmask exti line 4
		 EXTI->IMR1 |= EXTI_IMR1_IM2; //unmask exti line 2
		 EXTI->IMR1 |= EXTI_IMR1_IM1; //unmask exti line 1

		 //If COM closed return savely to IDLE
		 sm->currentState = STATE_IDLE;

		 entryDone = false;
	 }
}

/**
 * @brief Clean specified delimiter from string array.
 *
 * @param input: Input string to be cleaned
 * @param output: Destination buffer for cleaned string
 * @param delimiter: Delimiter character(s) to be removed
 */
void cleanString(const char* input, char* output, const char* delimiter) {
    char temp[128];  // Temporary buffer for safe modification
    strncpy(temp, input, sizeof(temp) - 1);
    temp[sizeof(temp) - 1] = '\0';  // Ensure null-termination

    char* token = strtok(temp, delimiter);
    output[0] = '\0';  // Start with an empty output string

    while (token != NULL) {
        strcat(output, token);  // Append token to output
        token = strtok(NULL, delimiter);
    }
}


/**
 * @brief Process USB commands received from host.
 *
 * @param command: Pointer to command buffer
 * @param length: Length of the command
 *
 * Handles various commands for power supply control including:
 * - OCP (Over-Current Protection) enable/disable
 * - Voltage and current settings
 * - Output enable/disable
 * - Query commands for device status
 */
void processUSBCommand(uint8_t* command, uint32_t length)
{
	// Verify device has Adjustable Power Delivery Object capability
    // If only fixed profiles available, abort communication
	if (dhandle->hasAPDO == true) {
		sm->pwrMode = MODE_APDO;
	}
	else {
		return;
	}

	// Null-terminate the command to ensure string functions work properly
	command[length] = '\0';

	// Make a copy for tokenization to preserve original command
	char cmd_copy[64] = {0};
	strncpy(cmd_copy, (char*)command, sizeof(cmd_copy)-1);

	// Remove whitespace characters
	char cmd_trimmed[64];
	cleanString(cmd_copy, cmd_trimmed, " ");

	// Extract command part (everything up to ":" )
	char* cmd_part = strtok(cmd_trimmed, ":");
	char* params = NULL; // Will hold the parameter value after the colon

	// Parameters start after the delimiter
	if (cmd_part != NULL && strlen(cmd_part) < length) {
		params = strtok(NULL, ":");  // Get remaining part after ':'
	}

	//Create buffer for response mesage
	char response[64];

	// Process different command types
    if (strcmp(cmd_part, "OCP1") == 0)
    {
    	snprintf(response, sizeof(response), "OCP enabled\r\n");

        sm->OCPMode = OCP_ENABLED;

		// Update Analog Watchdog limits for over-current detection
		int isense_Vtrip_mV = (dhandle->currentSet *G_SENSE*R_SENSE_MOHMS)/1000; // mV  (mA * mOhms * Gain)
		int isense_rawADCtrip= (isense_Vtrip_mV *4095) / VDDA_APPLI; //value for AWD treshold
		Update_AWD_Thresholds(0, isense_rawADCtrip, ADC_ANALOGWATCHDOG_2);
    }
    else if (strcmp(cmd_part, "OCP0") == 0)
    {
    	snprintf(response, sizeof(response), "OCP disabled\r\n");

        sm->OCPMode = OCP_DISABLED;

        // Set Analog Watchdog to disabled threshold
		Update_AWD_Thresholds(0, OCP_DISABLED_HT, ADC_ANALOGWATCHDOG_2);
    }
    else if (strcmp(cmd_part, "VSET1") == 0)
    {
    	// Set voltage mode and update voltage setting
    	sm->rotaryBtnPressed = true;
    	sm->setValueMode = SET_VOLTAGE;

    	uint32_t voltage = atof(params)*100; // Convert float to uint (also V to centivolts)

    	// Validate voltage is within allowed range
    	if (dhandle->voltageMin < voltage && voltage < dhandle->voltageMax) {
    	   	dhandle->voltageSet = voltage; //save in centivolts
    		snprintf(response, sizeof(response), "Voltage set to new value: %lu.%02lu V\r\n", dhandle->voltageSet / 100, dhandle->voltageSet % 100);
    	} else {
    		snprintf(response, sizeof(response), "ERROR: Voltage out of bounds\r\n");
    	}
    }
    else if (strcmp(cmd_part, "TIMEOUT1") == 0)
	{
		uint32_t ms = atof(params)*1000; // Convert float to uint milliseconds

		// Validate timeout is within acceptable range (0-10 seconds)
		if (0 < ms && ms < 10000) {
			sm->timeoutCounter = ms;
			snprintf(response, sizeof(response), "Timeout set to new value: %lu.%03lu s\r\n", ms / 1000, ms % 1000);
		} else {
			snprintf(response, sizeof(response), "ERROR: Timeout out of bounds (0-10s)\r\n");
		}
	}
    else if (strcmp(cmd_part, "VSET1?") == 0)
	{
		// Convert mV to V and format as "XX.XX V"
		snprintf(response, sizeof(response), "Voltage is set to: %lu.%02lu V\r\n", dhandle->voltageSet / 100, dhandle->voltageSet % 100);
	}
    else if (strcmp(cmd_part, "ISET1") == 0)
	{
    	sm->rotaryBtnPressed = true;
    	sm->setValueMode = SET_CURRENT;

		uint32_t current = atof(params)*1000; // Convert float parameter to integer

		// Validate current is within allowed range
		if (dhandle->currentMin < current && current < dhandle->currentMax) {
			dhandle->currentSet = current; //save in mA
			snprintf(response, sizeof(response), "Current set to new value: %lu.%03lu A\r\n", dhandle->currentSet / 1000, dhandle->currentSet % 1000);
		} else {
			snprintf(response, sizeof(response), "ERROR: Current out of bounds\r\n");
		}

	}
    else if (strcmp(cmd_part, "ISET1?") == 0)
  	{
    	// Convert mA to A and format as "X.XXX A"
  		snprintf(response, sizeof(response), "Current is set to: %lu.%03lu A\r\n", dhandle->currentSet / 1000, dhandle->currentSet % 1000);
  	}
    else if (strcmp(cmd_part, "OUT0") == 0)
   	{
   		snprintf(response, sizeof(response), "Output disabled\r\n");
   	    // Simulate button press if device is in active state
   		if (sm->currentState == STATE_ACTIVE) {
   	   		sm->outputBtnPressed = true;
   		}
   	}
    else if (strcmp(cmd_part, "OUT1") == 0)
	{
		snprintf(response, sizeof(response), "Output enabled\r\n");

		// Simulate button press if device is in idle state
		if (sm->currentState == STATE_IDLE) {
			sm->outputBtnPressed = true;
		}
	}
    else if (strcmp(cmd_part, "VOUT1?") == 0)
   	{
    	// Query measured output voltage
   		snprintf(response, sizeof(response), "Measured output voltage: %lu.%02lu V\r\n", dhandle->voltageMeas / 100, dhandle->voltageMeas % 100);
   	}
    else if (strcmp(cmd_part, "IOUT1?") == 0)
   	{
    	// Query measured output current
  		snprintf(response, sizeof(response), "Current is set to: %lu.%03lu A\r\n", dhandle->currentMeas / 1000, dhandle->currentMeas % 1000);
   	}
    else if (strcmp(cmd_part, "*IDN?") == 0)
	{
    	// Return device identification string
		snprintf(response, sizeof(response), "PPS-SINK-v0.2 (100W,21V,5A)\r\n");
	}
    else if (strcmp(cmd_part, "PROFILES?") == 0)
   	{
    	// Query available power profiles
    	bool printToCOM = true;
    	sourcecapa_limits(printToCOM);
   	}
    else
    {
    	// Handle unknown commands
        snprintf(response, sizeof(response), "Unknown command\r\n");
    }

    // Send response back to host
    CDC_Transmit_FS((uint8_t*)response, strlen(response));
}

