MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
			}
			else {
				outputState = OUTPUT_OFF_STATE;
				HAL_GPIO_WritePin(RELAY_ON_OFF_GPIO_Port, RELAY_ON_OFF_Pin, GPIO_PIN_RESET);
				// Use snprintf to limit the number of characters written
				int len = snprintf(_str, sizeof(_str), "--------Output Enabled--------");

				//Display voltage
				max7219_PrintIspecial(SEGMENT_1,dhandle->voltageSet, 3);
				//Display current
				max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet, 4);
			}

	//HAL_GPIO_TogglePin(RELAY_ON_OFF_GPIO_Port, RELAY_ON_OFF_Pin);
	//Get Voltage level into TRACE
	USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
}*/

/**
  * @brief  Extract source (adapter) capabilities and save them to SNKData_handle. If required print those capa. also to COM
  * @param  printToCom: Bool for specifying to print/not print to COM
  * @retval None
  * source: demo_disco.c Display_sourcecapa_menu_nav
  */
void sourcecapa_limits(bool printToCOM)
{
	// Entry actions (if just entered this state)
	static bool firstEntry = true;

	uint8_t _max = DPM_Ports[0].DPM_NumberOfRcvSRCPDO;
	uint8_t _start = 0;
	//SINKData_HandleTypeDef *dhandle = &SNK_data;
	dhandle->numProfiles = _max;
	static char all_profiles[500] = {0}; // Buffer for all profiles
	uint16_t offset = 0; // Position tracker in the all_profiles buffer

	// Clear the buffer at the start
	memset(all_profiles, 0, sizeof(all_profiles));

	for(int8_t index=_start; index < _max; index++)
	{
		char _str[50] = {0};

		switch(DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_TYPE_Msk)
		{
			case USBPD_PDO_TYPE_FIXED :
			{
				uint32_t maxcurrent = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_FIXED_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_FIXED_MAX_CURRENT_Pos)*10;
				uint32_t maxvoltage = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_FIXED_VOLTAGE_Msk) >> USBPD_PDO_SRC_FIXED_VOLTAGE_Pos)*50;
				sprintf((char*)_str, "FIXED:%2dV %2d.%dA \r\n", (int)(maxvoltage/1000), (int)(maxcurrent/1000), (int)((maxcurrent % 1000) /100));

				// Extract min and max values
				if (maxvoltage > dhandle->voltageMax*10) {
					dhandle -> voltageMax = (int)maxvoltage/10;
				}
				if (maxcurrent > dhandle->currentMax) {
					dhandle -> currentMax = (int)maxcurrent;
				}

				// Copy profiles to SNK data
				if (firstEntry) {
					if ((maxvoltage/1000 * maxcurrent/1000) <= 100) {
						dhandle->srcProfiles[index].voltageMax = maxvoltage/10; //save in centivolts
						dhandle->srcProfiles[index].currentMax = maxcurrent; //save in mA
						dhandle->srcProfiles[index].profileType = FIXED;
					}
				}

				break;
			}
			case USBPD_PDO_TYPE_BATTERY :
			{
			}
			break;
			case USBPD_PDO_TYPE_VARIABLE :
			{
				uint32_t maxvoltage = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_VARIABLE_MAX_VOLTAGE_Msk) >> USBPD_PDO_SRC_VARIABLE_MAX_VOLTAGE_Pos) * 50;
				uint32_t minvoltage = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_VARIABLE_MIN_VOLTAGE_Msk) >> USBPD_PDO_SRC_VARIABLE_MIN_VOLTAGE_Pos) * 50;
				uint32_t maxcurrent = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_VARIABLE_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_VARIABLE_MAX_CURRENT_Pos) * 10;
				sprintf((char*)_str, "V:%2d.%1d-%2d.%1dV %d.%dA \r\n", (int)(minvoltage/1000),(int)(minvoltage/100)%10, (int)(maxvoltage/1000),(int)(maxvoltage/100)%10, (int)(maxcurrent/1000), (int)((maxcurrent % 1000) /100));
			}
			break;
			case USBPD_PDO_TYPE_APDO :
			{
				uint32_t minvoltage = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_APDO_MIN_VOLTAGE_Msk) >> USBPD_PDO_SRC_APDO_MIN_VOLTAGE_Pos) * 100;
				uint32_t maxvoltage = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_APDO_MAX_VOLTAGE_Msk) >> USBPD_PDO_SRC_APDO_MAX_VOLTAGE_Pos) * 100;
				uint32_t maxcurrent = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_APDO_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_APDO_MAX_CURRENT_Pos) * 50;
				sprintf((char*)_str, "APDO:%2d.%1d-%2d.%1dV %d.%dA \r\n",(int) (minvoltage/1000),(int)(minvoltage/100)%10, (int)(maxvoltage/1000),(int)(maxvoltage/100)%10, (int)(maxcurrent/1000), (int)((maxcurrent % 1000) /100));

				// Set hasAPDO flag
				dhandle->hasAPDO = true;

				// Extract min and max values (since APDOs are last it will rewrite FIXED values,
				// this is what we want since if APDO is present the sink will default to APDO mode
				if (minvoltage < dhandle->voltageMin*10) {
					dhandle -> voltageMin = (int)minvoltage/10;
				}
				if (maxvoltage > dhandle->voltageMax*10) {
					dhandle -> voltageMax = (int)maxvoltage/10;
				}
				if (maxcurrent > dhandle->currentMax) {
					dhandle -> currentMax = (int)maxcurrent;
				}

				// Copy profiles to SNK data
				if (firstEntry) {
					if ((maxvoltage/1000 * maxcurrent/1000) <= 100) {
						dhandle->srcProfiles[index].voltageMin = minvoltage/10; //save in centivolts
						dhandle->srcProfiles[index].voltageMax = maxvoltage/10; //save in centivolts
						dhandle->srcProfiles[index].currentMax = maxcurrent; //save in mA
						dhandle->srcProfiles[index].profileType = APDO;
					}
				}
			}
			break;
			default :
			{
				sprintf((char*)_str,"Unknown Source PDO \r\n");
				break;
			}

			}
			// Add current profile to the buffer with bounds checking
			uint16_t len = strlen(_str);
			if (offset + len < sizeof(all_profiles) - 1) {
				memcpy(all_profiles + offset, _str, len);
				offset += len;
		} //switch end

	} //for end

	// Ensure null termination
	all_profiles[offset] = '\0';

	// Send all profiles at once
	if (printToCOM && offset > 0) {
		CDC_Transmit_FS((uint8_t*)all_profiles, offset);
	}

	// Clear first entry flag
	firstEntry = false;
}


// Helper function to update voltage
void updateVoltage(void) {

	switch (sm -> pwrMode) {
		case MODE_FIXED:
		{
				// Create helper index variable
				int8_t index = dhandle->selectedProfile + sm->encoder.direction;

				// Find index of next FixedPDO based on encoder turn direction (They are always at the beginning of Profiles list)
				if ((0 <= index) && (index <= dhandle->numProfiles -1)) {
					if (dhandle->srcProfiles[index].profileType != FIXED) {
						index = 0; //we are out of fixed profiles that are defined at beginning, return to 0
					}
				} else if (index < 0) {
					// Search for the last FixedPDO
					for (index = dhandle->numProfiles -1; index >= 0; index--) {
						if (dhandle->srcProfiles[index].profileType == FIXED) {
							break;
						}
					}
				} else if (index >= dhandle->numProfiles) {
					index = 0;
				}

