MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
				dhandle->selectedProfile = index;

				// Apply parameters of found srcProfile index
				dhandle->voltageMax = dhandle->srcProfiles[index].voltageMax;
				dhandle->voltageMin = dhandle->voltageMax;
				dhandle->voltageSet = dhandle->voltageMax;
				dhandle->currentMax = dhandle->srcProfiles[index].currentMax;

				// If new voltage has lower current limit adjust accordingly
				if (dhandle->currentSet > dhandle->currentMax) {
					dhandle->currentSet = dhandle->currentMax;
				}
		}
			break;

		case MODE_APDO:
		{
			//Get direction of encoder turning
			int voltageTemp = dhandle->voltageSet;
			voltageTemp += sm->encoder.direction * sm->encoder.increment;

			// Extract total bounds of APDO
			for (int8_t i = 0; i <= dhandle->numProfiles-1; i++) {
				if (dhandle->srcProfiles[i].profileType == APDO) {
					if (dhandle->srcProfiles[i].voltageMin < dhandle->voltageMin) {
						dhandle->voltageMin = dhandle->srcProfiles[i].voltageMin;
					}
					if (dhandle->srcProfiles[i].voltageMax > dhandle->voltageMax) {
						dhandle->voltageMax = dhandle->srcProfiles[i].voltageMax;
					}
					if (dhandle->srcProfiles[i].currentMax > dhandle->currentMax) {
						dhandle->currentMax = dhandle->srcProfiles[i].currentMax;
					}
				}

			}

			// If required temp value is within limits, assign it to voltage else assign limits
			if (dhandle->voltageMin <= voltageTemp && voltageTemp <= dhandle->voltageMax) {
				dhandle->voltageSet = voltageTemp; //asign new voltage
			} else {
				return;
			}
			// Update index
			int8_t index = dhandle->selectedProfile;
			// Search if there is APDO with higher current capability and satisfies voltageSet
			for (int8_t i = dhandle->numProfiles-1; i >= 0; i--) {
				if (dhandle->srcProfiles[i].profileType == APDO) {
					if (dhandle->voltageSet < dhandle->srcProfiles[i].voltageMax) {
						//update max current
						dhandle->currentMax = dhandle->srcProfiles[i].currentMax;

						//store profile index
						index = i;
					} else {
						break;
					}
				} else {
					break;
				}
			}

			dhandle->selectedProfile = index;

			// If new voltage has lower current limit adjust accordingly
			if (dhandle->currentSet > dhandle->currentMax) {
				dhandle->currentSet = dhandle->currentMax;
			}
			// dhandle->selectedProfile = USER_SERV_FindSRCIndex(0, &powerRequestDetails, compVoltage*10, dhandle->currentSet, dhandle ->selMethod);
		}
			break;
		default:
		{
		}
			break;
	}


	//Print selected voltage to disp, decimal at digit 3
	max7219_PrintIspecial(SEGMENT_1, dhandle->voltageSet, 3);
}

// Helper function to update current
void updateCurrent(void) {
	//Get direction of encoder turning
	int currentTemp = dhandle->currentSet;
	currentTemp += sm->encoder.direction * sm->encoder.increment;

	// If required temp value is within limits, assign it to voltage else assign limits
	if (dhandle->currentMin <= currentTemp && currentTemp <= dhandle->currentMax) {
		dhandle->currentSet = currentTemp; //asign new voltage
	} else {
		return;
	}

	//Print selected voltage to disp, decimal at digit 3
	max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet, 4);
}

// Helper function to update OCP current (INA 301)
void updateCurrentOCP(void) {
	//Get direction of encoder turning
	int currentTemp = dhandle->currentOCPSet;
	currentTemp += sm->encoder.direction * sm->encoder.increment;

	//If required temp value is within limits, assign it to voltage
	if ( (dhandle->currentMin <= currentTemp) && (currentTemp <= (dhandle->currentMax + 300)) ) {
		dhandle->currentOCPSet = currentTemp;
	} else {
		//currentOCPTemp = currentOCP;
	}

	int V_TRIP = (dhandle->currentOCPSet * R_OCP_MOHMS * G_OCP)/1000; // mV (mA * mOhms * Gain)
	//Convert DAC_OUT voltage to 12B resolution
	int dac_value = (V_TRIP *4095) / VDDA_APPLI;//__LL_ADC_DIGITAL_SCALE(LL_ADC_RESOLUTION_12B);
	//Write output with DAC..
	HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, dac_value);

	//Print selected voltage to disp, decimal at digit 3
	max7219_PrintIspecial(SEGMENT_2, dhandle->currentOCPSet, 4);
}

// Make voltage correction for the voltage drops on shunt resistors
uint32_t compensateVoltage(void) {
	uint32_t correction = (dhandle->currentMeas * (R_OCP_MOHMS + R_SENSE_MOHMS) ) / 1000;
	uint32_t compVoltage = dhandle->voltageSet + correction;

	// If corrected value is within limits proceed, else ask for mask Voltage
	return (compVoltage > dhandle->voltageMax) ? dhandle->voltageMax : compVoltage;
}
